#+title: Docker
#+author: Hackartist
#+startup: logdone
#+startup: inlineimages
#+Property: header-args :eval never-export
#+hugo_auto_set_lastmod: t

*** 도커 허브란?
    + 도커 이미지 검색 포털
      + =search= 하위 명령어를 통해서 이미지 검색 가능
        + 검색된 이미지로 컨테이너 생성이 가능함
        
#+begin_src bash :exports both 
  docker search ubuntu
  #+end_src

  #+RESULTS:
  | NAME                           | DESCRIPTION                                   | STARS | OFFICIAL | AUTOMATED |
  | ubuntu                         | Ubuntu is a Debian-based Linux operating sys… | 11806 | [OK]     |           |
  | dorowu/ubuntu-desktop-lxde-vnc | Docker image to provide HTML5 VNC interface   | …     | 497      | [OK]      |
  
** DB 생성 및 데이터 입력
   + =mongodb= 에 접속해서 아래와 같이 샘플 데이터 생성

#+BEGIN_SRC mongo :db emacs
use emacs
db.users.insert([
    {
        _id : ObjectId("507f191e810c19729de860ea"),
        title: "test",
        description: "test",
        tags: ['mongodb', 'database', 'NoSQL'],
        likes: 100
    },
    {
        title: "test2",
        description: "description2",
        tags: ['mongodb', 'database', 'NoSQL'],
        likes: 100
    },

])
#+END_SRC

#+RESULTS:
#+begin_example
switched to db emacs
BulkWriteResult({
	"writeErrors" : [ ],
	"writeConcernErrors" : [ ],
	"nInserted" : 2,
	"nUpserted" : 0,
	"nMatched" : 0,
	"nModified" : 0,
	"nRemoved" : 0,
	"upserted" : [ ]
})
#+end_example

** 데이터 조회
   + 아래의 커맨드를 통해서 데이터 조회
     
#+BEGIN_SRC mongo :db emacs 
  db.users.find()
#+END_SRC

#+results:
: { "_id" : ObjectId("507f191e810c19729de860ea"), "title" : "test", "description" : "test", "tags" : [ "mongodb", "database", "NoSQL" ], "likes" : 100 }
: { "_id" : ObjectId("601dd9fb4cbad7906637ae42"), "title" : "test2", "description" : "description2", "tags" : [ "mongodb", "database", "NoSQL" ], "likes" : 100 }

*** 도커 이미지 조회
    + =docker images= 로 조회
      + 레포지토리는 이미지들의 저장소를 의미함.
        + 통용적으로는 레포지토리의 마지막 =/= 뒤를 따서 이미지의 이름으로 부름.
      + 이미지는 단일 템플릿을 대상으로 하여, 해시 형태로 표현됨.

   #+begin_src bash :exports both
     docker images
#+end_src

#+RESULTS:
| REPOSITORY |    TAG | IMAGE        | ID | CREATED     | SIZE   |
| ubuntu     | latest | adafef2e596e |  7 | months  ago | 73.9MB |
| ubuntu     |  18.04 | d27b9ffc5667 |  7 | months  ago | 64.2MB |
| mongo      |  4.2.3 | bcef5fd2979d | 11 | months  ago | 386MB  |

**** 컨테이너 커밋 및 이미지 생성
     + =commit= 하위명령어를 이용하여 이미지 생성
       + =docker commit -m "{{message}}" {{container-name}} {{image-repository}}:{{tag-name}}=
         
#+begin_src bash
  docker commit -m "my own image" archlinux hackartist/my-own-image:latest
#+end_src

     + =images= 하위명령어를 이용하여 이미지 목록 확인
#+begin_src bash :exports both
  docker images 
#+end_src

#+RESULTS:
| REPOSITORY              | TAG    | IMAGE        | ID | CREATED      | SIZE  |
| hackartist/my-own-image | latest | 3b7256abb727 |  8 | minutes  ago | 406MB |
| hackartist/docker-dns   | latest | a006dfefbbbf |  7 | months   ago | 422MB |
   
     + =run= 하위명령어를 통해서 컨테이너 생성 후 확인
#+begin_src bash
  docker run -it --name myarch hackartist/my-own-image:latest
  cat /root/readme.md
#+end_src

**** 라우팅 정보 확인
     + =netstat= 을 이용하여 라우팅 정보 확인
       + =tun= 인터페이스와 일부 라우터가 추가된 것을 확인
#+begin_src bash :exports both
  netstat -nr
#+end_src

#+RESULTS:
|    Destination |       Gateway |         Genmask | Flags | MSS | Window | irtt | Iface           |
|      128.0.0.0 | 192.168.255.5 |       128.0.0.0 | UG    |   0 |      0 |    0 | tun0            |
|  192.168.255.1 | 192.168.255.5 | 255.255.255.255 | UGH   |   0 |      0 |    0 | tun0            |
|  192.168.255.5 |       0.0.0.0 | 255.255.255.255 | UH    |   0 |      0 |    0 | tun0            |

***** 라우팅 테이블 확인
      + 해당 대역에 대한 라우팅 정보가 추가된 것을 확인
      
       #+begin_src bash :exports results
         netstat -nr
#+end_src

#+RESULTS:
|    Destination |       Gateway |         Genmask | Flags | MSS | Window | irtt | Iface           |
|  192.168.100.0 | 192.168.255.5 |   255.255.255.0 | UG    |   0 |      0 |    0 | tun0            |
|  192.168.255.1 | 192.168.255.5 | 255.255.255.255 | UGH   |   0 |      0 |    0 | tun0            |
|  192.168.255.5 |       0.0.0.0 | 255.255.255.255 | UH    |   0 |      0 |    0 | tun0            |

  
